package none;

public class Main {

}

/**
 * 7월 5일
 * switch문
 * 만약 가능한 실행 경로가 여러 개인 경우에는 switch문을 사용
 * switch 선택구조: default문은 생략 가능, 변수와 일치하는 값을 가진 case절이 실행됨.
 * 
 * 반복문 for(고정된 반복) while(~하는 동안 반복) do-while (먼저 하고 ~하는 동안) fainted value(오염된 값)
 * 컴퓨터를 많이 사용하는 분야가 바로 반복적이고 지루한 작업의 자동화
 * 반복 구조가 필요한 이유는 같은 처리과정을 되풀이하는 것이 필요하기 때문이다.
 * while 주어진 조건이 만족되는 동안 문장들을 반복 실행한다.
 * while (조건식) -> 반복을 하는 조건이다. 조건이 참이면 반복을 계속한다. 
 * {
 *     문장1; -> 반복되는 문장이다.
 *     문장2;
 *     ...;
 * }
 * for문의 구조
 * for (초기식; 조건식; 증감식) {
 * 		반복문장;
 * } 증감식 수행 시점에 주의
 * 
 * random 클래스
 * 생성자 import java.util.Random
 * random() -> 새로운 난수 발생기 객체를 생성한다.
 * int nextInt(int n) -> 0과 n상의 int형의 난수를 발생한다. 
*/